# Carga de dados, armazenagem e formatos de arquivo

## Lendo e escrevendo dados em formato texto

In [1]:
import pandas as pd

In [2]:
!cat 'pydata-book/examples/ex1.csv'

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('pydata-book/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('pydata-book/examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat 'pydata-book/examples/ex2.csv'

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv('pydata-book/examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('pydata-book/examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names=['a','b','c','d','message']
pd.read_csv('pydata-book/examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!cat 'pydata-book/examples/csv_mindex.csv'

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [10]:
parsed = pd.read_csv('pydata-book/examples/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
list(open('pydata-book/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [12]:
result = pd.read_table('pydata-book/examples/ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [13]:
!cat 'pydata-book/examples/ex4.csv'

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [14]:
pd.read_csv('pydata-book/examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
!cat pydata-book/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [16]:
result = pd.read_csv('pydata-book/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
result = pd.read_csv('pydata-book/examples/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
sentinels = {'message':['foo','NA'],'something':['two']}

pd.read_csv('pydata-book/examples/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Lendo arquivos-texto em partes

In [20]:
pd.options.display.max_rows = 10

In [21]:
result = pd.read_csv('pydata-book/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [22]:
result = pd.read_csv('pydata-book/examples/ex6.csv',nrows=5)
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [23]:
chunker = pd.read_csv('pydata-book/examples/ex6.csv',chunksize=1000)
chunker

In [24]:
chunker = pd.read_csv('pydata-book/examples/ex6.csv',chunksize=1000)

tot = pd.Series([])

for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)

tot = tot.sort_values(ascending=False)

/tmp/ipykernel_13064/1768762809.py:3: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [25]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Escrevendo dados em formato texto

In [26]:
data = pd.read_csv('pydata-book/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
data.to_csv('pydata-book/examples/out.csv')

!cat pydata-book/examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [28]:
import sys

In [29]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [30]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [31]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [32]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [33]:
import numpy as np

In [34]:
dates = pd.date_range('1/1/2000',periods=7)

ts = pd.Series(np.arange(7),index=dates)

ts.to_csv('pydata-book/examples/tseries.csv')

!cat pydata-book/examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Trabalhando com formatos delimitados

In [35]:
!cat pydata-book/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [36]:
import csv
f = open('pydata-book/examples/ex7.csv')

reader = csv.reader(f)

In [37]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [38]:
with open ('pydata-book/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

header,values = lines[0],lines[1:]

data_dict = {h: v for h, v in zip(header,zip(*values))}

data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [39]:

class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = "'"
    quoting = csv.QUOTE_MINIMAL

with open ('pydata-book/examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    reader = csv.reader(f,dialect=my_dialect)

In [40]:
with open ('pydata-book/examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    reader = csv.reader(f,delimiter = '|')

In [41]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f,dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

!cat mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

### Dados JSON

In [42]:
obj = """
{
    "name": "Wes",
    "places_lived":["United States","Spain","Germay"],
    "pet":null,
    "siblings":[{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},
        {"name":"Katie","age":38,"pets":["Sixes","Stache","Cisco"]}]
}
"""

In [43]:
import json

In [44]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germay'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [45]:
asjson = json.dumps(result)

In [46]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [47]:
!cat pydata-book/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [48]:
data = pd.read_json('pydata-book/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [49]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [50]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML e HTML: web scraping

In [51]:
tables = pd.read_html('pydata-book/examples/fdic_failed_bank_list.html')

len(tables)

1

In [52]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [53]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Fazendo parse de XML com lxml.objectify

In [54]:
from lxml import objectify

path = 'pydata-book/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

data = []

skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

perf = pd.DataFrame(data)

perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [55]:
from io import StringIO

tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

root

In [56]:
root.get('href')

'http://www.google.com'

In [57]:
root.text

'Google'

## Formatos de dados binários

In [58]:
frame = pd.read_csv('pydata-book/examples/ex1.csv')

frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [59]:
frame.to_pickle('pydata-book/examples/frame_pickle')

In [60]:
pd.read_pickle('pydata-book/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Usando o HDF5

In [61]:
frame = pd.DataFrame({'a':np.random.randn(100)})

store = pd.HDFStore('mydata.h5')

store['obj1'] = frame

store['obj1_col'] = frame['a']

store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [62]:
store['obj1']

           a
0  -0.552512
1  -1.324265
2   0.860749
3   0.715705
4   0.695602
..       ...
95  0.570159
96 -1.141585
97 -0.825705
98  0.361398
99 -0.042531

[100 rows x 1 columns]

In [63]:
store.put('obj2',frame,format='table')

In [64]:
store.select('obj2',where=['index >= 10 and index <= 15'])

           a
10  0.685313
11  0.556005
12 -0.308069
13 -0.037924
14  0.721715
15  0.842261

In [65]:
store.close()

In [66]:
frame.to_hdf('mydata.h5','obj3',format='table')

In [67]:
pd.read_hdf('mydata.h5','obj3',where=['index < 5'])

          a
0 -0.552512
1 -1.324265
2  0.860749
3  0.715705
4  0.695602

### Lendo arquivos do Microsoft Excel

In [68]:
xlsx = pd.ExcelFile('pydata-book/examples/ex1.xlsx')

pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [69]:
frame = pd.read_excel('pydata-book/examples/ex1.xlsx','Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [70]:
writer = pd.ExcelWriter('pydata-book/examples/ex2.xlsx')

frame.to_excel(writer,'Sheet1')

writer.save()

In [71]:
frame.to_excel('pydata-book/examples/ex2.xlsx')

## Interagindo com APIs web

In [73]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

resp = requests.get(url)

resp

In [74]:
data = resp.json()

In [75]:
data[0]['title']

'TYP: more return annotations in core/'

In [76]:
issues = pd.DataFrame(data,columns = ['number','title','labels','state'])
issues

,number,title,labels,state
0,47618,TYP: more return annotations in core/,[],open
1,47616,TST: Added test for strides in column major Da...,[],open
2,47614,PERF: cut with IntervalIndex slower than cut w...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
3,47613,Fix Period not using freq when using same base...,[],open
4,47612,CLN: Add tets and fix docstring for concat wit...,[],open
...,...,...,...,...
25,47570,"BUG: Fixed `tm.set_locale` context manager, it...",[],open
26,47569,"CI 1.4.x: Typing error Overload 2 for ""searchs...","[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
27,47563,BUG: plot option sort_columns doesn't work,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,47557,ENH: RangeIndex._shallow_copy can return Range...,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
29,47554,"BUG: Series with same index values, but in dif...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

## Interagindo com bancos de dados

In [77]:
import sqlite3

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

con = sqlite3.connect('mydata.sqlite')

con.execute(query)

In [78]:
con.commit()

In [79]:
data = [('Atlanta','Georgia',1.25,6),('Tallahassee','Florida',2.6,3),('Sacramento','California',1.7,5)]

stmt = "INSERT INTO test VALUES(?,?,?,?)"

con.executemany(stmt,data)

In [80]:
con.commit()

In [81]:
cursor = con.execute('select * from test')

rows = cursor.fetchall()

rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [82]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [83]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [85]:
import sqlalchemy as sqla

db = sqla.create_engine('sqlite:///mydata.sqlite')

pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5